const ExplicitWords = (comment) => {
    const explicitWordsList = [
        'آب','آشغال','تناسلی','آلت','ابله','ابن','یزید','احمق','اسب','اسبی','اسکل','اسکل','اسگل','اسگول','الاغ','الاق','انگل','انی','اوسکل','اوسگل'
        ,'اوصکل','اوصگل','باسن','بخورش','بدبخت','بمال','تخمم','کیرم','بپرروش','بپرسرش','کونی','بکارت','بکن','توش','بکنش','بکنمت','خایه','بی','عفت','بی',
        'غیرت','بی','ناموس','بی','پدر','بیابخورش','بیشعور','بیناموس','تخم','تخمی','ترک','توله','جاکش','جلق','جنده','جنسی','جکس','جیندا',
        'حرومزاده','حشر','حشری','شدن','حشری','حیوانی','خارکس','ده','خارکسده','خارکسّه','خانم','جنده','خایه','خور','خایه','مال','خایه','خر','خرفت','خری','خز','خفه',
        'خون','خفه','خواهرجنده','خی','داگ','استایل','دخترجنده','دخترقرتی','درازگوش','دله','دهن','سرویس','گاییده','دهنت','سرویس','دوجنسه',
        'دول','دیوث','دیوس','خان','دیوس','دیوص','رشتی','ریدن','ریدی','زارت','زباله','زرنزن','جنده','کاسده','زنا','زنا','زنازاده','زنتو','زنشو','زنیکه'
        ,'سادیسمی','ساک','ساکونی','سرخور','سرکیر','سسکی','سوراخ','سوراخ','سولاخ','سکس','سکس','سکسی','باش','سکسی','سکسیم','سکسیی'
        ,'روحت','دهن','صفت','سگ','پدر','سگی','سیکتیر','شاسگول','شاش','شق','شل','مغز','شنگول','شهوتی','صیغه','صیک','عرب','عرق',
        'خور','عمتو','عمه','ننه','عن','تر','عن','عنتر','عوضی','غرمساق','غرمصاق','فاحشه','خانم','فاحشه','فارس','فاک','فیس','سوپر','قرتی','قرمساق','قرمصاق',
        'قس','لاس','لاش','گوشت','لاشی','لاکونی','لجن','لخت','لختی','لر','جنده','مادرجنده','مادرسگ','مادرقهوه','مادرکونی','مالوندن','ماچ','کردنی',
        'مرتیکه','مردیکه','مرض','مرضداری','مشروب','ملنگ','خور','ممه','منگل','میخوریش','نرکده','نعشه','نکبت','نگاییدم','هیز','ولدزنا','پدر','سوخته','پدر',
        'سگ','صلواتی','پدرسگ','پریود','پستان','پسون','پشمام','پفیوز','پلشت','پورن','پپه','چاغال','چاقال','چس','خور','چس','کاسکش','کث','لیس','کث','کثافت',
        'کثافط','کردنی','کرم','خل','خور','خیس','دادن','لیسیدن','کس','ننت', 'میگام',
        'کش','کسخل','کسشعر','کسکش','کسکیر','خل','کص','کصافت','کصافط','کصخل','کصکش','کلفت','کله','کیری','کوث','کوس','خل',
        'کوس','خور','کوس','کوس','خل','کوص','تپل','ده','سوراخ','کون','گنده','کونده','خار','کونده',
        'خوار','کونده','کونشو','کیر','کیردراز','کیردوس','کیرر','کیرمکیدن','کیرناز','کیروکس','کیروکس','کیری','گاو','گاییدم'
        ,'گاوی','گاگول','گایدن','گایدی','گاییدن','گردن','دراز','گشاد','گوز','گوزو','گوه','گی','زن','گیخوار','یبن','زنا','مادرتو','ناموستو','چنده'
        ,'باسنی','سیکیم','ناموس','نوب','خایمال','مادر','کصلیس','بکنت','کصده','گورومساخ','پوفیوز','پدرتو','قورومساق','اوبی','نگایدم']

    const commentWords = comment.split(' ')
    
    if (commentWords.some(word => explicitWordsList.includes(word))) { return true}
    else { return false }
}
 
export default ExplicitWords;